## Plan Result (hmcts_hub_dev_acme)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_group_member.dnszonecontributor
  * azurerm_role_assignment.app-proxy-ga-service-connection-secret-management




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_group_member.dnszonecontributor will be created
  + resource "azuread_group_member" "dnszonecontributor" {
      + group_object_id  = "a02b18e4-fba7-4d7d-9603-07e128f4126a"
      + id               = (known after apply)
      + member_object_id = "266e946b-e600-4575-826b-e0d322e13991"
    }

  # azurerm_role_assignment.app-proxy-ga-service-connection-secret-management will be created
  + resource "azurerm_role_assignment" "app-proxy-ga-service-connection-secret-management" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dad693c4-36ad-468f-94e9-76faa4bc844b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b50cfb90-d6cd-4e78-97e6-cb7958335b6e/resourceGroups/hub-dev-rg/providers/Microsoft.KeyVault/vaults/acmehmctshubdev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":27,"Program":"tfcmt","SHA1":"","Target":"hmcts_hub_dev_acme","Vars":{}} -->